src/Catalogs/ШагиАвтоматизации/ШагиАвтоматизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШагиАвтоматизации</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ЭкземплярыСценариевАвтоматизации</owners>
  <attributes>
    <name>УникальныйИдентификаторШаблонногоШага</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШага</name>
    <type>
      <types>EnumRef.ТипыЭлементовСхемыСценария</types>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>CatalogRef.КомандыАвтоматизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОборудования</name>
    <type>
      <types>CatalogRef.ШаблоныЕдиницАвтоматизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.АгентыКИП</types>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткатываемыйШаг</name>
    <type>
      <types>CatalogRef.ШагиАвтоматизации</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/СтруктураШаговСценария/СтруктураШаговСценария.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтруктураШаговСценария</name>
  <resources>
    <name>НомерШага</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УникальныйИдентификаторШага</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ТипШага</name>
    <type>
      <types>EnumRef.ТипыЭлементовСхемыСценария</types>
    </type>
  </resources>
  <resources>
    <name>ВремяНачала</name>
    <comment>Время суток, когда должно начаться выполнение шага, в случае успеха предыдущего</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СостояниеШага</name>
    <type>
      <types>EnumRef.СостоянияШаговСценария</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеШагаПриТесте</name>
    <type>
      <types>EnumRef.СостоянияШаговСценария</types>
    </type>
  </resources>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.АгентыКИП</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОборудования</name>
    <type>
      <types>CatalogRef.ШаблоныЕдиницАвтоматизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСтарта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСтартаТеста</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияТеста</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткатываемыйШаг</name>
    <type>
      <types>CatalogRef.ШагиАвтоматизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.ЭкземплярыСценариевАвтоматизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторШага</name>
    <type>
      <types>CatalogRef.ШагиАвтоматизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Команда</name>
    <type>
      <types>CatalogRef.КомандыАвтоматизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПараметрыШаговАвтоматизации/ПараметрыШаговАвтоматизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыШаговАвтоматизации</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ШаблонЗаполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторШага</name>
    <type>
      <types>CatalogRef.ШагиАвтоматизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Команда</name>
    <type>
      <types>CatalogRef.КомандыАвтоматизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СостоянияШаговСценария/СостоянияШаговСценария.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияШаговСценария</name>
  <enumValues>
    <name>НеВыполнялся</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ВыполненОткат</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ФатальнаяОшибка</name>
  </enumValues>
  <enumValues>
    <name>НеВыполнялсяВследствиеОтката</name>
  </enumValues>
  <enumValues>
    <name>НеВыполнялсяВследствиеОшибки</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеПрервано</name>
    <comment>Фактически фатальная ошибка, но выделено отдельно для идентификации &quot;неопределенных&quot; состояний контура</comment>
  </enumValues>
  <enumValues>
    <name>ОшибкаБезПрерыванияВыполнения</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ШагиАвтоматизации/ObjectModule.bsl
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПометкаУдаления Тогда
		// структура шагов
		НаборЗаписей = РегистрыСведений.СтруктураШаговСценария.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сценарий.Установить(Владелец);
		НаборЗаписей.Отбор.ИдентификаторШага.Установить(Ссылка);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Сценарий = Владелец;
		НоваяЗапись.ИдентификаторШага = Ссылка;
		НоваяЗапись.Команда = Команда;
		НоваяЗапись.НомерШага = Код;
		НоваяЗапись.УникальныйИдентификаторШага = УникальныйИдентификаторШаблонногоШага;
		НоваяЗапись.ТипШага = ТипШага;
		НоваяЗапись.ВремяНачала = ВремяНачала;
		НоваяЗапись.Использовать = Использовать;
		НоваяЗапись.Оборудование = Оборудование;
		НоваяЗапись.ШаблонОборудования = ШаблонОборудования;
		НоваяЗапись.ОткатываемыйШаг = ОткатываемыйШаг;
		НоваяЗапись.СостояниеШага = Перечисления.СостоянияШаговСценария.НеВыполнялся;
		
		НаборЗаписей.Записать();
	Иначе
		// структура шагов
		НаборЗаписей = РегистрыСведений.СтруктураШаговСценария.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторШага.Установить(Ссылка);
		
		НаборЗаписей.Записать();
		
		// структура параметров
		НаборЗаписей = РегистрыСведений.ПараметрыШаговАвтоматизации.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторШага.Установить(Ссылка);
		
		НаборЗаписей.Записать();

	КонецЕсли;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если НЕ Ссылка.ПометкаУдаления 
	//	И НЕ ПометкаУдаления 
	//	И НЕ ЭтоНовый() 
	//	И НЕ Владелец.Состояние.Пустая() 
	//	И Владелец.Состояние <> Перечисления.СостоянияСценария.НеЗапланирован 
	//	И Владелец.Состояние <> Перечисления.СостоянияСценария.Запланирован Тогда
	//		Отказ = Истина;
	//Иначе
		Если ЗначениеЗаполнено(ОткатываемыйШаг) И ОткатываемыйШаг.Использовать = Ложь Тогда
			Использовать = Ложь;
		КонецЕсли;	
	//КонецЕсли;	
КонецПроцедуры
#КонецЕсли

#КонецОбласти
